{
"websites" : [
  {
    "title": "The <strong class='whiteSpace--nowrap'>Co-operative</strong> Bank",
    "site": "co-operativebank.co.nz",
    "siteUrl": "https://www.co-operativebank.co.nz/",
    "image": "co-op.jpg",
    "role": "Front-end",
    "production": "Alphero",
    "productionUrl": "http://www.alphero.com/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Best Awards: Value of Design Award, Bronze<br>■ Best Awards: Best Effect Award, Finalist",
    "blurb": "<p>The Co-operative Bank’s digital offerings have a reputation for being user friendly and gorgeous. This project was no different and encompassed their public marketing site and their online banking.</p><p>Interestingly, the site was built mobile-last, following assurances it would never supplant their native mobile apps. Not surprisingly, Co-op made a u-turn on this decision, so retrospectively incorporated mobile-responsive layouts across the sites. Thankfully, our SASS framework made this relatively painless, proving its flexibility and strength.</p>"
  },
  {
    "title": "FMG Connect",
    "site": "fmgconnect.co.nz",
    "siteUrl": "https://www.fmgconnect.co.nz/login",
    "loginRequired": true,
    "image": "fmg.png",
    "role": "Front-end",
    "production": "Alphero",
    "productionUrl": "http://www.alphero.com/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>FMG wanted a responsive website their clients could log into to view, edit and update their insurance policies.</p><p>The large scope of project demanded well componetised SASS partials for future maintainability. Working closely with the developers we were able to deliver a tight and robust web app that has been extremely well received by their customers, prompting FMG to push their limited test release to all their customers early. FMG have also seen a marked increase in new business attributed to the app.</p>"
  },
  {
    "hide": true,
    "title": "Paymark",
    "site": "paymark.co.nz",
    "siteUrl": "https://www.paymark.co.nz/",
    "image": "paymark.jpg",
    "role": "Front-end",
    "production": "Alphero",
    "productionUrl": "http://www.alphero.com/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>********** TODO **********</p>"
  },
  {
    "title": "MyMSD",
    "site": "my.msd.govt.nz",
    "siteUrl": "https://my.msd.govt.nz/",
    "image": "mymsd.jpg",
    "role": "Front-end",
    "production": "Alphero",
    "productionUrl": "http://www.alphero.com/",
    "partner": "Fronde",
    "partnerUrl": "https://www.fronde.co.nz/",
    "partnerRole": "Development",
    "awards": "■ Best Awards: Large Scale Websites, Finalist",
    "blurb": "<p>We developed this responsive site in conjunction with Fronde and Ministry of Social Development to provide customers with a simple and convenient way to manage their appointments, check payments, notify MSD of changes, and apply for a benefit or NZ Super, all in one place.</p><p>The site is not just beautiful on the surface, it had to pass stringent accessibility standards. Many hours were spent traversing the site using my screen reader and refining the user experience.</p><p>Uptake was explosive and massive. Praise flowed in from case workers reporting it was much quicker and easier for them to do their jobs through the site rather than their standard systems.</p> "
  },
  {
    "hide": true,
    "title": "Loaded Card",
    "site": "http://www.loadedeveryday.co.nz/",
    "siteUrl": "loadedeveryday.co.nz",
    "image": "loaded.png",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>********** TODO **********</p>"
  },
  {
    "title": "Creative NZ",
    "site": "creativenz.govt.nz",
    "siteUrl": "http://creativenz.govt.nz/",
    "image": "creative-nz.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "3Months",
    "partnerUrl": "http://www.3months.com/",
    "partnerRole": "Development",
    "awards": "■ Awwwards: Honorable Mention",
    "blurb": "<p>As well as promoting and developing the arts, Creative NZ’s new website was designed to better facilitate artists in identifying and applying for funds.</p><p>This project was spread across three organisations: Optimal Usability, Springload and 3Months. The teams all came together to produce a website that exceeded the client’s expectations.</p>"
  },
  {
    "title": "NZ International Arts Festival",
    "site": "2010.nzfestival.co.nz",
    "siteUrl": "http://2010.nzfestival.co.nz/",
    "image": "nz-festival.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Interactive Media Awards: Best in class<br>■ Onya Awards: Best visual design<br>■ Best Awards: Large Scale Websites, Silver",
    "blurb": "<p>The 2010 International Arts Festival was a huge success with over 300,000 attendees and 300 events over 24 days.</p><p>The 2010 Festival website was Springload’s first to be built in HTML5. The crew at the festival office were encouraging of our desire to delve into emerging technologies, so we also implemented microformats. With a microformat extension for their browsers visitors were able to open venue locations in their mapping app of choice, and directly export events to their calendars.</p>"
  },
  {
    "title": "Australian School of Business, UNSW",
    "site": "business.unsw.edu.au",
    "siteUrl": "https://www.business.unsw.edu.au/",
    "image": "asb.jpg",
    "production": "Intergen",
    "productionUrl": "http://www.intergen.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>When Intergen called and asked if I’d be interested in heading a small team of front end developers to build a new responsive website for the University of New South Wales’s Business School I jumped at the chance. I was looking forward to both working alongside the Intergen crew and to the challenges of building a large scale site.</p><p>Some of the curlier aspects of the build were brought about by the technological constraints of Sharepoint and Internet Explorer 8. Bootstrap also has its shortcomings. Because the code base will be maintained by the client we aimed to employ Object Oriented CSS wherever possible, as a means of delivering readable and compact code. And the (near) end result is an engaging, mobile-first experience that the school is excited about.</p>"
  },
  {
    "title": "Wellington Airport",
    "site": "wellingtonairport.co.nz",
    "siteUrl": "http://www.wellingtonairport.co.nz/",
    "image": "wellington-airport.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>When Wellington Airport rebranded, they wanted a dynamic and fun website to reflect their dynamic and fun ethos.</p><p>Springload took the opportunity to make flight information much clearer and more easily accessible, and added a number of playful and interactive gems throughout the site.</p>"
  },
  {
    "title": "Kiwibank",
    "site": "kiwibank.co.nz <em>[archived]</em>",
    "siteUrl": "http://web.archive.org/web/20110227172309/http://www.kiwibank.co.nz/",
    "image": "kiwibank.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Best Awards: Large Scale Websites, Silver",
    "blurb": "<p>Kiwibank have been thinking up ways to give Kiwis better banking experience since 2002. But it wasn’t until they partnered with Springload that a modern website was designed and launched in 2008.</p><p>The build was a huge undertaking, but the results spoke for themselves. Kiwibank has since gone on to win numerous “Bank of the Year” awards, and membership has sky-rocketed with kiwis joining in the hundreds of thousands.</p>"
  },
  {
    "title": "Our Rock, Wellington Airport",
    "site": "wellingtonairport.co.nz/therock",
    "siteUrl": "http://www.wellingtonairport.co.nz/therock/",
    "image": "our-rock.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Webby Awards: Official Honoree",
    "blurb": "<p>Wellington Airport are so proud of their award winning terminal “Our Rock” that they just wanted to show it off. And thanks to some stunning photography this elegant microsite does a superb job of doing just that.</p>"
  },
  {
    "title": "Methven",
    "site": "methven.com",
    "siteUrl": "http://www.methven.com/nz/",
    "image": "methven.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "Designworks",
    "partnerUrl": "http://www.designworks.co.nz/",
    "partnerRole": "Design",
    "awards": "",
    "blurb": "<p>As part of a rebrand, Methven launched this large scale website promoting their stylish range of bathroom products in a soft and relaxing web experience.</p><p>As well as showing off their sophisticated accessories, the website also needed to meet other business objectives for distributors, investors and even provide technical specifications for plumbers.</p>"
  },
  {
    "title": "Kiwibank Mobile Banking",
    "site": "ib.kiwibank.co.nz/mobile",
    "siteUrl": "https://www.ib.kiwibank.co.nz/mobile/",
    "image": "kiwibank-mobile.png",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "Kiwibank",
    "partnerUrl": "http://www.kiwibank.co.nz/",
    "partnerRole": "Development",
    "awards": "■ Onya Awards: Best Mobile Website<br>■ TUANZ Awards: Mobile Application of the Year",
    "blurb": "<p>New Zealand’s first mobile banking web app was designed and built to work on modern smart phones, with a simplified version for “second tier” devices. The site allows Kiwibank customers to view transactions and payments, and perform money transfers.</p><p>This was Springload’s foray into mobile design and development. The experimental nature of this job and the wide range of target devices meant testing was paramount. Many hours were spent tweaking code and refreshing mobile browsers littered across my desk.</p>"
  },
  {
    "title": "Gibson Sheat",
    "site": "gibsonsheat.com",
    "siteUrl": "http://www.gibsonsheat.com/",
    "image": "gibson-sheat.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Webby Awards: Official Honoree",
    "blurb": "<p>After getting some fresh new branding Gibson Sheat wanted a website to promote themselves as down-to-earth and approachable lawyers.</p><p>Springload’s design and build were very pleasing to the client. So much so in fact, they went on to get an in-house web app designed and built by Springload to track jobs.</p>"
  },
  {
    "title": "Right House",
    "site": "righthouse.co.nz",
    "siteUrl": "http://www.righthouse.co.nz/",
    "image": "right-house.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>The Right House website provides information on making your house a more healthy and energy-efficienct home, with tips and advice on products and services—all presented in Right House’s colourful and fun brand.</p>"
  },
  {
    "title": "MySuper",
    "site": "mysuper.co.nz",
    "siteUrl": "https://www.mysuper.co.nz/",
    "image": "my-super.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>MySuper is a tool for ACC employees to join and calculate their superannuation scheme. There is also a sister site for logged in users to manage how their investment funds are allocated.</p><p>The calculator and form designs demanded particular attention be paid to widget details.</p>"
  },
  {
    "title": "Wellington Jazz Festival",
    "site": "jazzfestival.co.nz <em>[archived]</em>",
    "siteUrl": "http://web.archive.org/web/20090324031804/http://www.jazzfestival.co.nz/programme/",
    "image": "jazz-festival.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "■ Webby Awards: Official Honoree",
    "blurb": "<p>More than 75 artists from 11 countries descended on Wellington for a four day jazztravaganza like no other.</p><p>This elegantly designed website <i>drummed</i> up enthusiasm for the performances, as well as providing <i>key</i> information on the events.</p>"
  },
  {
    "title": "REAL NZ&nbsp;2011 Festival",
    "site": "nz2011.govt.nz <em>[site deleted]</em>",
    "siteUrl": "",
    "image": "nz2011.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>In 2011, New Zealand hosted 120,000 international visitors during the Rugby World Cup. A nationwide festival—our largest ever—was launched with over 1,000 events, showcasing Kiwi business, culture, food and wine, concerts, exhibitions, and our passion for the outdoors.</p><p>The REAL New Zealand Festival website was a huge undertaking, with a remarkably tight timeframe. Many late nights were spent building and perfecting the numerous templates required for go-live.</p><p>The site functionality continued to grow throughout the duration of the RWC. The website was a huge success, but was deleted following the festival, leaving only memories of something quite fantastic.</p>"
  },
  {
    "title": "Showtools",
    "site": "showtools.com",
    "siteUrl": "http://www.showtools.com/",
    "image": "showtools.png",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "",
    "partnerUrl": "",
    "partnerRole": "",
    "awards": "",
    "blurb": "<p>Showtools provide a suite of online tools for the film and television industry, facilitating the booking of crew and rental equipment, as well as production planning for shoots.</p><p>I’d performed a lot of work on the booking tools in the application itself, now the whole suite required a public web face to allow the client to market the services. For their new site I took a mobile first approach implementing the best in Object Oriented CSS with SASS to keep the code base clean.</p><p>The site features a custom drawn set of vector glyphs, CSS animations, and responds fluidly across devices.</p>"
  },
  {
    "title": "Deaf Aotearoa",
    "site": "deaf.org.nz",
    "siteUrl": "http://www.deaf.org.nz/",
    "image": "deaf-association.jpg",
    "production": "Springload",
    "productionUrl": "http://www.springload.co.nz/",
    "partner": "Creature",
    "partnerUrl": "http://www.creature.co.nz/",
    "partnerRole": "Design",
    "awards": "■ Best Awards: Large Scale Websites, Bronze",
    "blurb": "<p>Deaf Aotearoa provides information and resources on life for deaf New Zealanders, deaf culture and New Zealand Sign Language to help strengthen the rights of Deaf people and give them the confidence to be an active part of society.</p><p>Once a year the website switches themes to put on an entirely new look for New Zealand Sign Language week.</p>"
  }
],
"apps" : [
  {
    "title": "Mastermind",
    "site": "apps/mastermind",
    "siteUrl": "http://www.analog.co.nz/apps/mastermind",
    "image": "mastermind.jpg",
    "production": "Analog",
    "productionUrl": "http://www.analog.co.nz/",
    "blurb": "<p>Can you crack the secret code?</p><p>Mastermind is an old favourite of mine and to turn it into a striking app that I could enjoy and share was a small, but rewarding, labour of love.</p><p>This features drag’n’drop on touch devices, and leverages offline storage so you can play this anywhere, anytime.</p><p><a href='apps/mastermind/'><button class='block'>Bust a code <span class='glyph  glyph-right-open'></span></button></a></p>"
  },
  {
    "title": "Typesetter",
    "site": "apps/typesetter",
    "siteUrl": "http://www.analog.co.nz/apps/typesetter",
    "image": "typesetter.png",
    "production": "Analog",
    "productionUrl": "http://www.analog.co.nz/",
    "blurb": "<p>Typesetter provides quick and simple in-the-browser typeface prototyping for web designers. Fine-tune your typography on the device of your choice, with control over font-family, point size, spacing, leading, kerning, colour and more.</p><p>The app was born from my desire to preview and test fonts—particularly on iOS—without the faff of fiddling about with stylesheets.</p><p><a href='apps/typesetter/'><button class='block'>Set some type <span class='glyph  glyph-right-open'></span></button></a></p>"
  }
]}
